# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11n-BiFPN-CBAM specific configuration

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] 

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 3-P4/16
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P5/32
  - [-1, 1, Conv, [512, 3, 2]] # 5-P6/64
  - [-1, 2, C3k2, [512, True]] # 6-P6/64
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P7/128
  - [-1, 2, C3k2, [1024, True]] # 8-P7/128
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, C2PSA, [1024]] # 10

# YOLO11n Head with BiFPN and CBAM
head:
  # --- BiFPN Layer 1 (High Level Features) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  
  # Prepare P4 (Layer 6) to match channels of P5 (Layer 11)
  # Layer 6 is 512 channels. Layer 11 (upsampled P5) is 1024 channels.
  # We must align them. Let's target 512 channels.
  - [11, 1, Conv, [512, 1, 1]] # 12 Reduce P5 to 512
  - [6, 1, Conv, [512, 1, 1]]  # 13 Ensure P4 is 512 (it should be, but safety first)
  
  # Now both inputs are 512. We can add them.
  - [[12, 13], 1, BiFPN_Concat, [1]] # 14
  - [-1, 2, C3k2, [512, False]] # 15

  # --- BiFPN Layer 2 (Medium Level Features) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  
  # Prepare P3 (Layer 4) to match P4. Target 256 channels.
  - [16, 1, Conv, [256, 1, 1]] # 17 Reduce P4 result to 256
  - [4, 1, Conv, [256, 1, 1]]  # 18 Ensure P3 is 256
  
  - [[17, 18], 1, BiFPN_Concat, [1]] # 19
  - [-1, 2, C3k2, [256, False]] # 20 (This is the P3 output)

  # --- Attention Block (CBAM) ---
  - [-1, 1, CBAM, [7]] # 21 (Apply attention to P3)

  # --- Bottom-up Path ---
  - [-1, 1, Conv, [256, 3, 2]] # 22 Downsample P3
  
  # Merge with P4 again. Target 512 channels.
  - [22, 1, Conv, [512, 1, 1]] # 23
  - [15, 1, Conv, [512, 1, 1]] # 24 (Bring back the P4 result from earlier)
  
  - [[23, 24], 1, BiFPN_Concat, [1]] # 25
  - [-1, 2, C3k2, [512, False]] # 26 (This is P4 output)

  - [-1, 1, Conv, [512, 3, 2]] # 27 Downsample P4
  
  # Merge with P5. Target 1024 channels (or 512 if keeping light).
  # Let's keep 512 for efficiency on your 4GB GPU.
  - [10, 1, Conv, [512, 1, 1]] # 28 (Original P5 from backbone)
  
  - [[27, 28], 1, BiFPN_Concat, [1]] # 29
  - [-1, 2, C3k2, [1024, True]] # 30 (This is P5 output)

  # --- Detect ---
  - [[20, 26, 30], 1, Detect, [nc]] # 31 Detect(P3, P4, P5)